particle-iot/device-os/hal/src/nRF52840/usart_hal.cpp
    void enableTimer() {
        NRFX_IRQ_DISABLE(nrfx_get_irq_number((void*)timer_));
        nrf_timer_mode_set(timer_, NRF_TIMER_MODE_COUNTER);
        nrf_timer_bit_width_set(timer_, NRF_TIMER_BIT_WIDTH_16);
        nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_CLEAR);
        nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_START);

        nrf_ppi_channel_endpoint_setup(ppi_, (uint32_t)&uarte_->EVENTS_RXDRDY,
                (uint32_t)&timer_->TASKS_COUNT);
        nrf_ppi_channel_enable(ppi_);
    }

    void disableTimer() {
        nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_CLEAR);
        nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_SHUTDOWN);
        nrf_ppi_channel_disable(ppi_);
        rxConsumed_ = 0;
    }

    size_t timerValue() {
        nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_CAPTURE0);
        return nrf_timer_cc_read(timer_, NRF_TIMER_CC_CHANNEL0);
    }

    bool willPreempt() const {
        // Check if interrupts are disabled:
        // 1. Globally
        // 2. Application interrupts through SoftDevice
        // 3. Via BASEPRI
        if (HAL_IsIrqMasked(nrfx_get_irq_number((void*)uarte_)) || nrf_nvic_state.__cr_flag) {
            return false;
        }

        if (HAL_IsISR()) {
            if (!HAL_WillPreempt(nrfx_get_irq_number((void*)uarte_), HAL_ServicedIRQn())) {
                return false;
            }
        }

        return true;
    }

    static bool validateConfig(unsigned int config) {
        CHECK_TRUE((config & SERIAL_MODE) == SERIAL_8N1 ||
                   (config & SERIAL_MODE) == SERIAL_8E1 ||
                   (config & SERIAL_MODE) == SERIAL_8N2 ||
                   (config & SERIAL_MODE) == SERIAL_8E2, false);

        CHECK_TRUE((config & SERIAL_HALF_DUPLEX) == 0, false);
        CHECK_TRUE((config & LIN_MODE) == 0, false);

        // LIN-mode configuration and half-duplex pin configuration is ignored

        return true;
    }

    struct BaudrateMap {
        unsigned int baudRate;
        nrf_uarte_baudrate_t nrfBaudRate;
    };

    static int getNrfBaudrate(unsigned int baudRate) {
        for (unsigned int i = 0; i < sizeof(baudrateMap_) / sizeof(baudrateMap_[0]); i++) {
            if (baudrateMap_[i].baudRate == baudRate) {
                return baudrateMap_[i].nrfBaudRate;
            }
        }

        return SYSTEM_ERROR_NOT_FOUND;
    }

private:
    static constexpr const BaudrateMap baudrateMap_[] = {
        { 1200,     NRF_UARTE_BAUDRATE_1200    },
        { 2400,     NRF_UARTE_BAUDRATE_2400    },
        { 4800,     NRF_UARTE_BAUDRATE_4800    },
        { 9600,     NRF_UARTE_BAUDRATE_9600    },
        { 14400,    NRF_UARTE_BAUDRATE_14400   },
        { 19200,    NRF_UARTE_BAUDRATE_19200   },
        { 28800,    NRF_UARTE_BAUDRATE_28800   },
        { 38400,    NRF_UARTE_BAUDRATE_38400   },
        { 57600,    NRF_UARTE_BAUDRATE_57600   },
        { 76800,    NRF_UARTE_BAUDRATE_76800   },
        { 115200,   NRF_UARTE_BAUDRATE_115200  },
        { 230400,   NRF_UARTE_BAUDRATE_230400  },
        { 250000,   NRF_UARTE_BAUDRATE_250000  },
        { 460800,   NRF_UARTE_BAUDRATE_460800  },
        { 921600,   NRF_UARTE_BAUDRATE_921600  },
        { 1000000,  NRF_UARTE_BAUDRATE_1000000 }
    };

    NRF_UARTE_Type* uarte_;
    void (*interruptHandler_)(void);
    app_irq_priority_t prio_;
    NRF_TIMER_Type* timer_;
    nrf_ppi_channel_t ppi_;

    pin_t txPin_;
    pin_t rxPin_;
    pin_t ctsPin_;
    pin_t rtsPin_;

    bool configured_ = false;
    volatile bool enabled_ = false;
    volatile bool suspend_ = false;

    volatile bool transmitting_;
    volatile uint8_t receiving_;
    volatile size_t rxConsumed_;

    Config config_ = {};

    particle::services::RingBuffer<uint8_t> txBuffer_;
    particle::services::RingBuffer<uint8_t> rxBuffer_;

    EventGroupHandle_t evGroup_;
};

constexpr const Usart::BaudrateMap Usart::baudrateMap_[];

const auto UARTE0_INTERRUPT_PRIORITY = APP_IRQ_PRIORITY_LOW;
// TODO: move this to hal_platform_config.h ?
const auto UARTE1_INTERRUPT_PRIORITY = (app_irq_priority_t)_PRIO_SD_LOWEST;

Usart* getInstance(HAL_USART_Serial serial) {
    static Usart usartMap[] = {
        {NRF_UARTE0, uarte0InterruptHandler, UARTE0_INTERRUPT_PRIORITY, NRF_TIMER2, NRF_PPI_CHANNEL4, TX, RX, CTS, RTS},
        {NRF_UARTE1, uarte1InterruptHandler, UARTE1_INTERRUPT_PRIORITY, NRF_TIMER3, NRF_PPI_CHANNEL5, TX1, RX1, CTS1, RTS1}
    };

    CHECK_TRUE(serial < sizeof(usartMap) / sizeof(usartMap[0]), nullptr);

    return &usartMap[serial];
}

void uarte0InterruptHandler(void) {
    getInstance(HAL_USART_SERIAL1)->interruptHandler();
}

void uarte1InterruptHandler(void) {
    getInstance(HAL_USART_SERIAL2)->interruptHandler();
}

} // anonymous

extern "C" void UARTE1_IRQHandler(void) {
    uarte1InterruptHandler();
}

int hal_usart_init_ex(HAL_USART_Serial serial, const HAL_USART_Buffer_Config* config, void*) {
    auto usart = CHECK_TRUE_RETURN(getInstance(serial), SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);

    return usart->init(*config);
}

void hal_usart_init(HAL_USART_Serial serial, Ring_Buffer* rxBuffer, Ring_Buffer* txBuffer) {
    HAL_USART_Buffer_Config conf = {
        .size = sizeof(HAL_USART_Buffer_Config),
        .rx_buffer = rxBuffer->buffer,
        .rx_buffer_size = sizeof(rxBuffer->buffer),
        .tx_buffer = txBuffer->buffer,
        .tx_buffer_size = sizeof(txBuffer->buffer)
    };

    hal_usart_init_ex(serial, &conf, nullptr);
}

void hal_usart_begin_config(HAL_USART_Serial serial, uint32_t baud, uint32_t config, void*) {
#if PLATFORM_ID == PLATFORM_TRACKER
    /*
     * On Tracker both I2C_INTERFACE3 and USART_SERIAL1 use the same pins - D8 and D9,
     * We cannot enable both of them at the same time.
     */
    if (serial == HAL_USART_SERIAL1) {
        if (hal_i2c_is_enabled(HAL_I2C_INTERFACE3, nullptr)) {
            // Unfortunately we cannot return an error code here
            return;
        }
    }
#endif

    auto usart = getInstance(serial);
    // FIXME: CHECK_XXX that doesn't return anything?
    if (!usart) {
        return;
    }

    Usart::Config conf = {
        .baudRate = baud,
        .config = config
    };

    usart->begin(conf);
}

void hal_usart_begin(HAL_USART_Serial serial, uint32_t baud) {
    hal_usart_begin_config(serial, baud, SERIAL_8N1, nullptr);
}

void hal_usart_end(HAL_USART_Serial serial) {
    auto usart = getInstance(serial);
    // FIXME: CHECK_XXX?
    if (!usart) {
        return;
    }

    usart->end();
}

int32_t hal_usart_available_data_for_write(HAL_USART_Serial serial) {
    auto usart = CHECK_TRUE_RETURN(getInstance(serial), SYSTEM_ERROR_NOT_FOUND);
    return usart->space();
}

